title: Suspicious Process Excluding System
id: 12345678-1234-1234-1234-123456789ac1
status: test
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        EventID: 1
    filter:
        Image|endswith:
            - '\svchost.exe'
            - '\explorer.exe'
    condition: selection and not filter
