title: Base64 Encoded Command
id: 12345678-1234-1234-1234-123456789ac0
status: test
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|base64: "powershell"
    condition: selection
