title: Lookup Malicious Commands
id: 12345678-1234-1234-1234-123456789ac3
status: test
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|lookup: malicious_commands
    condition: selection
