title: Test All Custom Attributes
id: 10000004-0000-0000-0000-000000000004
status: test
description: Test using all custom attributes in one rule
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine: test.exe
  condition: selection
custom:
  opensearch_ppl_index: "complete-test-*"
  opensearch_ppl_min_time: "-14d"
  opensearch_ppl_max_time: "now"
