title: Test Time Rounding
id: 10000007-0000-0000-0000-000000000007
status: test
description: Test time modifiers with rounding
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine: test.exe
  condition: selection
custom:
  opensearch_ppl_min_time: "-1month@month"
  opensearch_ppl_max_time: "+1d@d"
