title: Test Absolute Time Range
id: 10000008-0000-0000-0000-000000000008
status: test
description: Test absolute time ranges
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine: test.exe
  condition: selection
custom:
  opensearch_ppl_min_time: "2024-01-15 10:00:00"
  opensearch_ppl_max_time: "2024-01-15 16:00:00"
