title: Process Creation by User
id: 12345678-1234-1234-1234-123456789abd
status: test
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        EventID: 1
    condition: selection | count() by User > 100
