title: IP Range Detection
id: 12345678-1234-1234-1234-123456789ac5
status: test
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        SourceIP|cidr: '192.168.1.0/24'
    condition: selection
