title: Password Near Admin
id: 12345678-1234-1234-1234-123456789ac2
status: test
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|near:
            - "password"
            - "admin"
    condition: selection
