title: Network Connection to Suspicious Port
status: test
description: Manual test for network connection detection
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        DestinationPort:
            - 4444
            - 5555
            - 6666
        Initiated: 'true'
    condition: selection
