title: Regex Pattern Match
id: 12345678-1234-1234-1234-123456789ac4
status: test
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|re: '.*powershell.*-enc(oded)?.*'
    condition: selection
