title: Recent Failed Logins
id: 12345678-1234-1234-1234-123456789abf
status: test
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4625
    condition: selection
timeframe: 5m
