title: Base64 Encoded Command Detection
id: 00000005-0004-0004-0004-000000000004
status: test
description: Tests regex for detecting base64 encoded commands
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|re: '(?i).*-e(nc(odedcommand)?|c)\s+[A-Za-z0-9+/]{50,}={0,2}.*'
    condition: selection
