title: Scheduled Task Creation
id: 00000006-0006-0006-0006-000000000006
status: test
description: Detects suspicious scheduled task creation
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\schtasks.exe'
        CommandLine|contains|all:
            - '/create'
            - '/tn'
    condition: selection
