title: Suspicious Service Installation
id: 00000006-0007-0007-0007-000000000007
status: test
description: Detects installation of suspicious Windows services
logsource:
    category: process_creation
    product: windows
detection:
    selection_image:
        Image|endswith: '\sc.exe'
    selection_command:
        CommandLine|contains:
            - 'create'
            - 'config'
    selection_binpath:
        CommandLine|contains: 'binpath'
    condition: selection_image and selection_command and selection_binpath
