title: Rare Process Execution
id: 00000006-0002-0002-0002-000000000002
status: test
description: Detects rarely executed processes
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        EventID: 1
    condition: selection | rare Image by Computer
