title: Multiple Failed Logins
id: 0e95725d-7320-415d-80f7-004da920fc11
description: Detects multiple failed login attempts to a destination host
status: test
author: Sigma Correlation Test
date: 2025-12-03
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4625
            - 529
        Status: 'Failed'
    condition: selection
# Correlation metadata for event_count
correlation:
    type: event_count
    rules:
        - 0e95725d-7320-415d-80f7-004da920fc11
    group-by:
        - ComputerName
    timespan: 1h
    condition:
        gte: 100
